/***  kadai2.c  ***/
/***  s12169  2J34  èºîˆóSâ¿  ***/

#include<stdio.h>
#define MAX_ARRAY 38

int GetnRow(char map[][MAX_ARRAY])
{
	int i=0;
	while (map[i][0] == '|') i++;
	if(map[i][0] == '\0') {
		return i;
	} else {
		return -1;
	}
}

int GetnColumn(char map[][MAX_ARRAY])
{
	int i=0,j=0;
	while (map[0][i] != '\0' && i<MAX_ARRAY) {
		if (map[0][i] == '|') j++;
		i++;
	}
	if(map[0][i] == '\0' ) {
		return j;
	} else {
		return -1;
	}
}

void DisplayAmida(char map[][MAX_ARRAY])
{
	int i,j;
	for (i=0; i<GetnColumn(map); i++){
		printf("   %d",i);
	}
	printf("\n");
	for (i=0; i<GetnRow(map); i++) {
		printf("%2d ",i);
		for (j=0; j<GetnColumn(map)*2-1; j++) {
			if (map[i][j] == ' ') {
				printf("   ");
			} else if (map[i][j] == '-') {
				printf("---");
			} else if (map[i][j] == '|') {
				printf("|");
			}
		}
		printf("\n");
	}
	for (i=0; i<GetnColumn(map); i++){
		printf("   %c",'A'+i);
	}
	printf("\n");
}

int RemoveBarfromAmida(char map[][MAX_ARRAY],int rmrow,int rmcol)
{
	int row, col, i=-1;
	row = GetnRow(map);
	col = GetnColumn(map);
	if (rmcol >= 0 && rmrow > 0 && rmcol < col-2 && rmrow < row-1 && map[rmrow][2*rmcol+1] == '-') {
		map[rmrow][2*rmcol+1] = ' ';
		return 0;
	} else { 
		return -1;
	}
}

int AddBartoAmida(char map[][MAX_ARRAY],int addrow,int addcol)
{
	int row, col;
	row = GetnRow(map);
	col = GetnColumn(map);
	if (addcol >= 0 && addrow > 0 && addcol < col-2 && addrow < row-1 && map[addrow][2*addcol+1] == ' ' && map[addrow][2*addcol-1] != '-' && map[addrow][2*addcol+3] != '-') {
		map[addrow][2*addcol+1] = '-';
		return 0;
	} else {
		return -1;
	}
}

int main(void)
{
	int row, col, res=-1, i=0;
	char map[MAX_ARRAY][MAX_ARRAY] = {
		{'|',' ','|',' ','|',' ','|',' ','|','\0'},
		{'|','-','|',' ','|','-','|',' ','|','\0'},
		{'|',' ','|',' ','|',' ','|','-','|','\0'},
		{'|',' ','|','-','|',' ','|',' ','|','\0'},
		{'|',' ','|','-','|',' ','|','-','|','\0'},
		{'|','-','|',' ','|','-','|',' ','|','\0'},
		{'|',' ','|',' ','|',' ','|',' ','|','\0'},
		{'|','-','|',' ','|',' ','|','-','|','\0'},
		{'|',' ','|','-','|',' ','|',' ','|','\0'},
		{'|',' ','|',' ','|','-','|',' ','|','\0'},
		{'|',' ','|','-','|',' ','|','-','|','\0'},
		{'|','-','|',' ','|','-','|',' ','|','\0'},
		{'|',' ','|',' ','|',' ','|',' ','|','\0'},
		{'|',' ','|','-','|',' ','|','-','|','\0'},
		{'|','-','|',' ','|',' ','|',' ','|','\0'},
		{'|',' ','|',' ','|',' ','|',' ','|','\0'},
		{'\0','\0','\0','\0','\0','\0','\0','\0','\0','\0'}
	};
	
	/* ç≈èâÇÃèÛë‘ÇÃï\é¶ */
	printf("----------ç≈èâÇÃèÛë‘----------\n");
	DisplayAmida(map);
	
	/* Ç†Ç›ÇæÇ≠Ç∂Ç©ÇÁâ°ñ_ÇéÊÇËèúÇ≠ÉeÉXÉg */
	printf("----------â°ñ_ÇÃçÌèú----------\nâ°ñ_ÇéÊÇËèúÇ≠à íuÇì¸óÕ([çs][óÒ])--->");
	scanf("%d %d", &row, &col);
	res = RemoveBarfromAmida(map, row, col);
	if (res==0) DisplayAmida(map);
	/* Ç†Ç›ÇæÇ≠Ç∂Ç…â°ñ_Çâ¡Ç¶ÇÈÉeÉXÉg */
	printf("----------â°ñ_ÇÃí«â¡----------\nâ°ñ_Çí«â¡Ç∑ÇÈà íuÇì¸óÕ([çs][óÒ])--->");
	scanf("%d %d", &row, &col);
	res = AddBartoAmida(map, row, col);
	if (res==0) DisplayAmida(map);
	
	return 0;
}
/* é¿çsåãâ  

----------ç≈èâÇÃèÛë‘----------
   0   1   2   3   4
 0 |   |   |   |   |
 1 |---|   |---|   |
 2 |   |   |   |---|
 3 |   |---|   |   |
 4 |   |---|   |---|
 5 |---|   |---|   |
 6 |   |   |   |   |
 7 |---|   |   |---|
 8 |   |---|   |   |
 9 |   |   |---|   |
10 |   |---|   |---|
11 |---|   |---|   |
12 |   |   |   |   |
13 |   |---|   |---|
14 |---|   |   |   |
15 |   |   |   |   |
   A   B   C   D   E
----------â°ñ_ÇÃçÌèú----------
â°ñ_ÇéÊÇËèúÇ≠à íuÇì¸óÕ([çs][óÒ])--->3 1
   0   1   2   3   4
 0 |   |   |   |   |
 1 |---|   |---|   |
 2 |   |   |   |---|
 3 |   |   |   |   |
 4 |   |---|   |---|
 5 |---|   |---|   |
 6 |   |   |   |   |
 7 |---|   |   |---|
 8 |   |---|   |   |
 9 |   |   |---|   |
10 |   |---|   |---|
11 |---|   |---|   |
12 |   |   |   |   |
13 |   |---|   |---|
14 |---|   |   |   |
15 |   |   |   |   |
   A   B   C   D   E
----------â°ñ_ÇÃí«â¡----------
â°ñ_Çí«â¡Ç∑ÇÈà íuÇì¸óÕ([çs][óÒ])--->6 2
   0   1   2   3   4
 0 |   |   |   |   |
 1 |---|   |---|   |
 2 |   |   |   |---|
 3 |   |   |   |   |
 4 |   |---|   |---|
 5 |---|   |---|   |
 6 |   |   |---|   |
 7 |---|   |   |---|
 8 |   |---|   |   |
 9 |   |   |---|   |
10 |   |---|   |---|
11 |---|   |---|   |
12 |   |   |   |   |
13 |   |---|   |---|
14 |---|   |   |   |
15 |   |   |   |   |
   A   B   C   D   E

----------ç≈èâÇÃèÛë‘----------
   0   1   2   3   4
 0 |   |   |   |   |
 1 |---|   |---|   |
 2 |   |   |   |---|
 3 |   |---|   |   |
 4 |   |---|   |---|
 5 |---|   |---|   |
 6 |   |   |   |   |
 7 |---|   |   |---|
 8 |   |---|   |   |
 9 |   |   |---|   |
10 |   |---|   |---|
11 |---|   |---|   |
12 |   |   |   |   |
13 |   |---|   |---|
14 |---|   |   |   |
15 |   |   |   |   |
   A   B   C   D   E
----------â°ñ_ÇÃçÌèú----------
â°ñ_ÇéÊÇËèúÇ≠à íuÇì¸óÕ([çs][óÒ])--->0 1
----------â°ñ_ÇÃí«â¡----------
â°ñ_Çí«â¡Ç∑ÇÈà íuÇì¸óÕ([çs][óÒ])--->0 2

----------ç≈èâÇÃèÛë‘----------
   0   1   2   3   4
 0 |   |   |   |   |
 1 |---|   |---|   |
 2 |   |   |   |---|
 3 |   |---|   |   |
 4 |   |---|   |---|
 5 |---|   |---|   |
 6 |   |   |   |   |
 7 |---|   |   |---|
 8 |   |---|   |   |
 9 |   |   |---|   |
10 |   |---|   |---|
11 |---|   |---|   |
12 |   |   |   |   |
13 |   |---|   |---|
14 |---|   |   |   |
15 |   |   |   |   |
   A   B   C   D   E
----------â°ñ_ÇÃçÌèú----------
â°ñ_ÇéÊÇËèúÇ≠à íuÇì¸óÕ([çs][óÒ])--->11 2
   0   1   2   3   4
 0 |   |   |   |   |
 1 |---|   |---|   |
 2 |   |   |   |---|
 3 |   |---|   |   |
 4 |   |---|   |---|
 5 |---|   |---|   |
 6 |   |   |   |   |
 7 |---|   |   |---|
 8 |   |---|   |   |
 9 |   |   |---|   |
10 |   |---|   |---|
11 |---|   |   |   |
12 |   |   |   |   |
13 |   |---|   |---|
14 |---|   |   |   |
15 |   |   |   |   |
   A   B   C   D   E
----------â°ñ_ÇÃí«â¡----------
â°ñ_Çí«â¡Ç∑ÇÈà íuÇì¸óÕ([çs][óÒ])--->7 1

*/